In [1]:
import pandas as pd

In [2]:
pwd

'/Users/leehyeongmin/python_data'

In [6]:
df = pd.read_csv('example.csv')

In [7]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [8]:
newdf = df[['a','b']]

In [9]:
newdf

    a   b
0   0   1
1   4   5
2   8   9
3  12  13

In [11]:
newdf.to_csv('mynew.csv',index=False)

In [12]:
pd.read_csv('mynew.csv')

    a   b
0   0   1
1   4   5
2   8   9
3  12  13

In [18]:
df = pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

In [19]:
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [20]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [22]:
df = pd.read_html('view-source:https://www.naver.com/')

ValueError: No tables found